app/controllers/emp_sessions_controller.rb

  def create
    employee = Employee.find_by(username: params[:session][:username])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."username" = ? LIMIT ?  [["username", "krkrishnaraj11"], ["LIMIT", 1]]