app/controllers/employees_controller.rb

UPDATE "employees" SET "personal_email" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["personal_email", "krkrishnaraj11@gmail.com"], ["updated_at", "2018-01-15 12:17:03.414379"], ["id", 4]]
---
  def edit
    @employee = current_employee

    if params["fb"]
      config = request.env['omniauth.auth']['credentials']
      @graph = Koala::Facebook::API.new(config['token'])
      user = @graph.get_object('me?fields=picture,name,email,birthday')
      if user['email'] || user['birthday']
        @employee.update_attributes(personal_email: user['email'],
                date_of_birth: date_converter(user['birthday']) )

INSERT INTO "employees" ("name", "gender", "designation", "phone", "email", "date_of_join", "address", "active", "username", "date_of_birth", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @employee = Employee.new(employee_params_signup)
    if @employee.save

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "employees" SET "personal_email" = ?, "picture" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["personal_email", ""], ["picture", "19959086_840917506071825_9160077355275252552_n.jpg"], ["updated_at", "2018-01-06 06:46:45.619284"], ["id", 4]]
---
  def update
    @employee = Employee.find(params[:id])
    if logged_in_admin?
      if @employee.update_attributes(employee_params_admin_update)

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def employeedetails
    @employee = Employee.find(params[:id])

SELECT  "employees".* FROM "employees" LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "employees"
---
  def employeetable
    @employee = Employee.paginate(page: params[:page], :per_page => 2)

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def adminedit
    @employee = Employee.find(params[:id])